[
  {
    "img":"Educational Workshop at GSSS, Domehar (Koshish Club)",
    "title":"JUIT’s Koshish Club Empowers Underprivileged Children Through Educational Workshop",
    "date":"12 April 2024",
    "content":"On April 12th, 2024, the Koshish Club of Jaypee Youth Club at Jaypee University of Information Technology orchestrated a transformative Educational Workshop at Government Senior Secondary School, Domehar. Spearheaded by faculty coordinator Dr. Raj Kumar, a dedicated team of student volunteers, including Vidushi, Niharika, Palak Sharma, Nikhilesh, Nitish Gupta, Anjali Panwar, Dhriti Sharma, Vanshaj Sharma, Vardaan, and Aastha Jain, orchestrated the event.",
    "link":"https://himachaltonite.com/education/juits-koshish-club-empowers-underprivileged-children-through-educational-workshop/"
  },
  {
    "img":"Educational Workshop at GSSS, Domehar (Koshish Club)",
    "title":"JUIT organizes Educational Workshop",
    "date":"12 April 2024",
    "content":"The Koshish Club of Jaypee Youth Club at Jaypee University of Information Technology, a dedicated initiative within the JYC aimed at providing underprivileged children with access to quality education, organised an Educational Workshop at Government Senior Secondary School, Domehar.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/juit-organizes-educational-workshop/"
  },
  {
    "img":"Murious",
    "title":"“MURIOUS 18.0”: Marks Resounding Success in Tech Excellence and Innovation At JUIT",
    "date":"08 March 2024",
    "content":"The annual three-day tech fest, “MURIOUS 18.0,” at Jaypee University of Information Technology concluded on a triumphant note, underscoring the collaborative efforts of faculty coordinator Dr. Naveen Jaglan and student coordinators from Jaypee Youth Club (JYC). ",
    "link":"https://himachaltonite.com/himachal/murious-18-0-marks-resounding-success-in-tech-excellence-and-innovation-at-juit/"
  },
  {
    "img":"Murious",
    "title":"“MURIOUS 18.0” concludes with postive vibes",
    "date":"08 March 2024",
    "content":"The “MURIOUS 18.0” at Jaypee University of Information Technology from 8 to 10th March, stands as a testament to the collaborative efforts of both faculty coordinator Dr. Naveen Jaglan and student coordinators of Jaypee Youth Club.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/murious-18-0-concludes-with-postive-vibes/"
  },
  {
    "img":"Murious",
    "title":"MURIOUS 18.0 held at JUIT",
    "date":"08 March 2024",
    "content":"Jaypee University of Information Technology commenced the much-anticipated tech fest named MURIOUS 18.0, a three-day extravaganza brimming with technological innovation, creative expression, and spirited competition.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/murious-18-0-held-at-juit/"
  },
  {
    "img":"Murious",
    "title":"MURIOUS 18.0 Unveils : Technological Extravaganza at JUIT’s Grand Inauguration",
    "date":"08 March 2024",
    "content":"On March 8, 2024, the Jaypee University of Information Technology came alive with the commencement of MURIOUS 18.0, a three-day tech fest promising a fusion of technological prowess, creative expression, and spirited competition.",
    "link":"https://himachaltonite.com/himachal/murious-18-0-unveils-technological-extravaganza-at-juits-grand-inauguration/"
  },
  {
    "img":"Semester Sports Tournaments",
    "title":"Jaypee University Of Information Technology organise Semester Sports Tournament",
    "date":"12 February 2023",
    "content":"The semester tournaments hosted by Jaypee University of Information Technology from February 12th to 18th emerged as a proud celebration of athleticism and sportsmanship, drawing enthusiastic participation from students across diverse disciplines.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/jaypee-university-of-information-technology-organize-semester-sports-tournament/"
  },
  {
    "img":"Semester Sports Tournaments",
    "title":"JUIT’s Semester Sports Extravaganza: Triumph of Skill, Spirit, and Unity",
    "date":"12 February 2023",
    "content":"Solan, February 19, 2024: The sprawling campus of Jaypee University of Information Technology (JUIT) transformed into a cauldron of excitement and athleticism as the Semester Sports Tournament unfolded from February 12th to 18th. The event, meticulously organized by the Sports Club JYC, showcased an impressive array of sporting talents and a commitment to broadening the horizons of athletic competition.",
    "link":"https://himachaltonite.com/himachal/juits-semester-sports-extravaganza-triumph-of-skill-spirit-and-unity/"
  },
  {
    "img":"Alumini Meet",
    "title":"ALUMNI MEET 2023 JAYPEE UNIVERSITY OF INFORMATION TECHNOLOGY WAKNAGHAT",
    "date":"09 December 2023",
    "content":"The Alumni Meet convened at Jaypee University Of Information Technology on December 9th, organised by the JUIT Alumni Cell, was met with enthusiasm as approximately 50 alumni accompanied by their families attended the event.",
    "link":"https://www.livenews24tv.com/?p=8816"
  },
  {
    "img":"Alumini Meet",
    "title":"JUIT Alumni Reconnect in Grand Celebration, Fostering Bonds and Memories",
    "date":"09 December 2023",
    "content":"Solan, Dec 11 : The Jaypee University Of Information Technology (JUIT) witnessed a joyous reunion as approximately 50 alumni, accompanied by their families, gathered for the Alumni Meet organized by the JUIT Alumni Cell on December 9th. The event was marked by enthusiasm and camaraderie, creating an atmosphere of shared memories and new connections.",
    "link":"https://himachaltonite.com/himachal/juit-alumni-reconnect-in-grand-celebration-fostering-bonds-and-memories/"
  },
  {
    "img":"ICIIP",
    "title":"JUIT : International Conference on Image Information Processing (ICIIP 2023) Marks a Milestone in Academic Discourse",
    "date":"22 November 2023",
    "content":"The Seventh International Conference on Image Information Processing (ICIIP), a prestigious biennial event initiated by Jaypee University of Information Technology in 2011, unfolded its virtual realms from 22nd to 24th November 2023. Under the aegis of Jaypee Group and IEEE sponsorship, ICIIP has emerged as a pivotal platform for the global computer science community, fostering the exchange of insights, research findings, and ideas in Image Processing and allied fields.",
    "link":"https://himachaltonite.com/himachal/juit-international-conference-on-image-information-processing-iciip-2023-marks-a-milestone-in-academic-discourse/"
  },
  {
    "img":"ICIIP",
    "title":"JUIT organizes International Conference on Image Information Processing (2023)",
    "date":"22 November 2023",
    "content":"The International Conference on Image Information Processing (ICIIP) is a biennial event hosted by Jaypee University of Information Technology since 2011, with the sponsorship of Jaypee Group and IEEE.",
    "link":"https://crazynewsindia.com/education-news/juit-organizes-international-conference-on-image-information-processing-2023/"
  },
  {
    "img":"Master Chef",
    "title":"Jaypee University of Information Technology Hosts Master Chef Competition 2023",
    "date":"04 November 2023",
    "content":"Solan, November 6: On November 4, 2023, the Jaypee University of Information Technology played host to the highly anticipated Master Chef Competition, a culinary spectacle that enthralled the entire campus. The event commenced at 3:00 PM with a ceremonial lamp-lighting ceremony led by the distinguished faculty coordinator, Dr. Naveen Jaglan, and the president of the Jaypee Youth Club, Shivansh Mehrotra.",
    "link":"https://himachaltonite.com/himachal/jaypee-university-of-information-technology-hosts-master-chef-competition-2023/"
  },
  {
    "img":"Parakram",
    "title":"Parakram 2023: Celebration of Sportsmanship, Unity, and Excellence",
    "date":"08 October 2023",
    "content":"Jaypee University of Information Technology (JUIT) recently hosted Parakram 2023 from October 6th to 8th, a spectacular sporting event that left a lasting impression on participants and spectators alike. This three-day extravaganza was a tribute to extraordinary talent, unwavering sportsmanship, and the spirit of camaraderie.",
    "link":"https://himachaltonite.com/uncategorized/parakram-2023-celebration-of-sportsmanship-unity-and-excellence/"
  },
  {
    "img":"Parakram",
    "title":"Parakram 2023: A Triumph of Sport, Unity and Excellence",
    "date":"08 October 2023",
    "content":"Solan, Jaypee University of Information Technology (JUIT) played host to Parakram 2023 from 6th to 8th October, a sporting extravaganza that left an indelible mark on participants and spectators alike.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/parakram-2023-a-triumph-of-sport-unity-and-excellence/"
  },
  {
    "img":"Parakram",
    "title":"Parakram 2023: A Spectacular Showcase of Sportsmanship and Skill at JUIT",
    "date":"07 October 2023",
    "content":"The Jaypee University of Information Technology (JUIT) came alive with excitement on the second day of Parakram 2023, its annual sports extravaganza. This event brought together young athletes from various colleges and universities, showcasing their skills, strategies, and sportsmanship in a wide range of sports.",
    "link":"https://himachaltonite.com/himachal/parakram-2023-a-spectacular-showcase-of-sportsmanship-and-skill-at-juit/"
  },
  {
    "img":"Parakram",
    "title":"JUIT Parakram 2 day fill with fierce competition and sportsmanship",
    "date":"07 October 2023",
    "content":"The Jaypee University of Information Technology (JUIT) came alive once again on the second day of Parakram 2023, the annual sports extravaganza that brings together young athletes from various colleges and universities.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/juit-parakram-2-day-fill-with-fierce-competition-and-sportsmanship/"
  },
  {
    "img":"Parakram",
    "title":"‘Parakram 2023’ sport’s fest to be organise by JUIT",
    "date":"06 October 2023",
    "content":"In a vibrant display of unity and sportsmanship, Parakram 2023, the annual sports fest organised by Jaypee University Of Information Technology’s Youth Club, commenced with gusto following a dazzling opening ceremony hosted at the JUIT auditorium by the Honourable Vice Chancellor, Prof. R.K. Sharma along with Registrar and dean of students Maj. Gen. Rakesh Bassi. Faculty Coordinator, JYC, Dr. Naveen Jaglan, Sports faculty Coordinator, Mr. Muneesh Sood, Former JYC faculty coordinator, Dr. Amit Srivastava, Associate Dean (Innovations) Prof. Shruti Jain, Media In-charge, JUIT, Prof. Tiratha Raj Singh and other faculty members along with several students joined this inaugural ceremony.",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/parakram-2023-sports-fest-to-be-organized-by-juit/"
  },
  {
    "img":"Parakram",
    "title":"Parakram 2023: Celebration of Unity and Sportsmanship Starts At JUIT",
    "date":"06 October 2023",
    "content":"Parakram 2023, the annual sports fest organized by Jaypee University of Information Technology’s Youth Club, kicked off with immense enthusiasm following a spectacular opening ceremony hosted at the JUIT auditorium.",
    "link":"https://himachaltonite.com/himachal/parakram-2023-celebration-of-unity-and-sportsmanship-starts-at-juit/"
  },
  {
    "img":"Gandhi Jayanti and Lal Bahadur Shashtri Jayanti",
    "title":"Gandhi and Lal Bahadur Shastri Jayanti Celebrated at JUIT",
    "date":"02 October 2023",
    "content":"On 2nd October 2023, Jaypee University Of Information Technology orchestrated a vibrant and inspiring event to commemorate Gandhi Jayanti and Shastri Jayanti, honouring the enduring legacies of two remarkable leaders, Mahatma Gandhi and Lal Bahadur Shastri.",
    "link":"https://himachaltonite.com/education/gandhi-and-lal-bahadur-shastri-jayanti-celebrated-at-juit/"
  },
  {
    "img":"Gandhi Jayanti and Lal Bahadur Shashtri Jayanti",
    "title":"Jaypee University Of Information Technology Solan",
    "date":"02 October 2023",
    "content":"On 2nd October 2023, Jaypee University Of Information Technology  orchestrated a vibrant and inspiring event to commemorate Gandhi Jayanti and Shastri Jayanti, honoring the enduring legacies of two remarkable leaders, Mahatma Gandhi and Lal Bahadur Shastri.",
    "link":"https://shikharnewsindia.com/archives/2897"
  },
  {
    "img":"Gandhi Jayanti and Lal Bahadur Shashtri Jayanti",
    "title":"JUIT orchestrate a vibrant and inspiring event to commemorate Gandhi Jayanti and Shastri Jayanti",
    "date":"02 October 2023",
    "content":"On 2nd October 2023, Jaypee University Of Information Technology orchestrated a vibrant and inspiring event to commemorate Gandhi Jayanti and Shastri Jayanti, honouring the enduring legacies of two remarkable leaders, Mahatma Gandhi and Lal Bahadur Shastri. ",
    "link":"https://crazynewsindia.com/breaking-news-flash-news/juit-orchestrate-a-vibrant-and-inspiring-event-to-commemorate-gandhi-jayanti-and-shastri-jayanti/"
  },
  {
    "img": "Hindi Diwas",
    "title": "जेपी यूनिर्वसिटी में मनाया गया हिंदी दिवस",
    "date": "14 September 2023",
    "content": "जेपी यूथ क्लब के साहित्यिक और वाद-विवाद क्लब ने जेपी सूचना प्रौद्योगिकी विश्वविद्यालय में लंबे समय से प्रतीक्षित हिंदी दिवस 14 सितम्बर 2023 को बड़े उत्साह के साथ मनाया।",
    "link": "https://himachaltonite.com/education/%e0%a4%9c%e0%a5%87%e0%a4%aa%e0%a5%80-%e0%a4%af%e0%a5%82%e0%a4%a8%e0%a4%bf%e0%a4%b0%e0%a5%8d%e0%a4%b5%e0%a4%b8%e0%a4%bf%e0%a4%9f%e0%a5%80-%e0%a4%ae%e0%a5%87%e0%a4%82-%e0%a4%ae%e0%a4%a8%e0%a4%be/"
  },
  {
    "img": "Hindi Diwas",
    "title": "जेपी सूचना प्रौद्योगिकी विश्वविद्यालय में हिंदी दिवस बड़े उत्साह के साथ मनाया गया",
    "date": "14 September 2023",
    "content": "जेपी यूथ क्लब के साहित्यिक और वाद-विवाद क्लब ने जेपी सूचना प्रौद्योगिकी विश्वविद्यालय में लंबे समय से प्रतीक्षित हिंदी दिवस 14 सितम्बर 2023 को बड़े उत्साह के साथ मनाया।",
    "link": "https://crazynewsindia.com/breaking-news-flash-news/hindi-diwas-celebrated-with-great-enthusiasm-in-jaypee-university-of-information-technology/"
  },
  {
    "img": "Semester Sports Tournaments",
    "title": "JUIT: Semester Sports Tournament Held",
    "date": "25 August 2023",
    "content": "The Semester Sports Tournament, hosted by JUIT, kicked off on August 25th with a burst of enthusiasm, promoting physical fitness, camaraderie, and healthy competition among students.",
    "link": "https://himachaltonite.com/education/juit-semester-sports-tournament-held-2/"
  },
  {
    "img": "Semester Sports Tournaments",
    "title": "JUIT organises Semester Sports Tournament",
    "date": "25 August 2023",
    "content": "Semester Sports Tournament, organised at JUIT, started from 25th of August, commenced with great enthusiasm, promoting physical fitness, camaraderie, and healthy competition among students.",
    "link": "https://crazynewsindia.com/breaking-news-flash-news/juit-organizes-semester-sports-tournament/"
  },
  {
    "img": "Diksha",
    "title": "Jaypee University Of Information Technology Solan “Diksha 2023”",
    "date": "16 September 2023",
    "content": "Jaypee University of Information Technology came alive with the vibrancy and glamour on the evening of September 16th as it hosted the eagerly anticipated “DIKSHA” freshers’ party.",
    "link": "https://shikharnewsindia.com/archives/2883"
  },
  {
    "img": "Diksha",
    "title": "“DIKSHA” freshers’ party rocked JUIT",
    "date": "16 September 2023",
    "content": "Jaypee University of Information Technology came alive with the vibrancy and glamour on the evening of September 16th as it hosted the eagerly anticipated “DIKSHA” freshers’ party.",
    "link": "https://himachaltonite.com/education/diksha-freshers-party-rocked-juit/"
  },
  {
    "img": "Diksha",
    "title": "JUIT hosts “DIKSHA” freshers’ party",
    "date": "16 September 2023",
    "content": "Jaypee University of Information Technology came alive with the vibrancy and glamour on the evening of September 16th as it hosted the eagerly anticipated “DIKSHA” freshers’ party. This year the theme of the event was Bollywood and it lived up to the hype in grand style.",
    "link": "https://crazynewsindia.com/breaking-news-flash-news/juit-hosts-diksha-freshers-party/"
  },
  {
    "img": "Swachhta Pakhwada",
    "title": "JUIT’s Environment Club Observing Swacchata Pakhwada from September 1st to 15th",
    "date": "01 September 2023",
    "content": "The Environment, Ecology and Health Club, a branch of the JUIT Youth Club (JYC) at Jaypee University of Information Technology in Waknaghat, Solan, H.P., is currently marking Swacchata Pakhwada from September 1st to September 15th. On the inaugural day, a dedicated team of 25 students and faculty members initiated a plastic waste removal campaign near the university market.",
    "link": "https://himachaltonite.com/education/juits-environment-club-observing-swacchata-pakhwada-from-september-1st-to-15th/"
  }
]
